tests/linearHall/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.3.1                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object blockMeshDict;
}

    convertToMeters 1;
    vertices (
        (0      0      0)
        (1.0    0      0)
        (1.0    0.1    0)
        (0      0.1    0)
        (0      0      0.1)
        (1.0    0      0.1)
        (1.0    0.1    0.1)
        (0      0.1    0.1)
    );

    blocks (
        hex (0 1 2 3 4 5 6 7) (80 10 10) simpleGrading (1 1 1)
    );

    edges ( );

    boundary (
        inlet
        {
            type patch;
            faces ((0 3 2 1));
        }

        outlet
        {
            type patch;
            faces ((4 5 6 7));
        }

        walls
        {
            type wall;
            faces
            (
                (0 4 7 3)
                (1 2 6 5)
                (0 1 5 4)
                (3 7 6 2)
            );
        }
    );

    mergePatchPairs ();
